Конфигурация/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <attributes>
    <name>НаименованиеяПоставщика</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСПоставщиком</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/Заказы/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТабличнаяЧасть1ЦенаПриИзменении(Элемент)
	Замена = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	Замена.Сумма = Замена.Цена * Замена.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧасть1КоличествоПриИзменении(Элемент)
	Замена = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	Замена.Сумма = Замена.Цена * Замена.Количество;
КонецПроцедуры
